NivyaS2k15/embeddedSystemMain/stm32Barematel/Assignment_LED/TASK1/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

#include <stdint.h>
#include <stdio.h>
#include "stm32f446xx.h"
#include "stm32f446xx_gpio_driver.h"

#define LED_PIN     GPIO_PIN_NO_5
#define BUTTON_PIN  GPIO_PIN_NO_13
/* ===== External LED Pins ===== */
#define EXT_LED1_PIN    GPIO_PIN_NO_6      // External LED 1 (PA6)
#define EXT_LED2_PIN    GPIO_PIN_NO_7      // External LED 2 (PA7)  // PA7
void delay_5ms(void)
{
    for (volatile uint32_t i = 0; i < 840000; i++);
}


/* Simple busy-wait delay (~250 ms) */
void delay_250ms(void)
{
    for (volatile uint32_t i = 0; i < 420000; i++);
}

int main(void)
{
    GPIO_Handle_t GpioLed, GpioButton,GpioExtLed1,GpioExtLed2;

    /* ================= LED CONFIG : PA5 ================= */
    GpioLed.pGPIOx = GPIOA;
    GpioLed.GPIO_PinConfig.GPIO_PinNumber = LED_PIN;
    GpioLed.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
    GpioLed.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_MEDIUM;
    GpioLed.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
    GpioLed.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;

    GPIO_Init(&GpioLed);

    /* ================= BUTTON CONFIG : PC13 ================= */
    GpioButton.pGPIOx = GPIOC;
    GpioButton.GPIO_PinConfig.GPIO_PinNumber = BUTTON_PIN;
    GpioButton.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_IN;
    GpioButton.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
    GpioButton.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_PIN_PU;

    GPIO_Init(&GpioButton);



    /* ================= EXTERNAL LED 1 : PA6 ================= */
       GpioExtLed1.pGPIOx = GPIOA;
       GpioExtLed1.GPIO_PinConfig.GPIO_PinNumber = EXT_LED1_PIN;
       GpioExtLed1.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
       GpioExtLed1.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_MEDIUM;
       GpioExtLed1.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
       GpioExtLed1.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
       GPIO_Init(&GpioExtLed1);

       /* ================= EXTERNAL LED 2 : PA7 ================= */
       GpioExtLed2.pGPIOx = GPIOA;
       GpioExtLed2.GPIO_PinConfig.GPIO_PinNumber = EXT_LED2_PIN;
       GpioExtLed2.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
       GpioExtLed2.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_MEDIUM;
       GpioExtLed2.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
       GpioExtLed2.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
       GPIO_Init(&GpioExtLed2);
    /* ================= MAIN LOOP ================= */
    while (1)
    {
        /* Button is ACTIVE LOW */
        if (GPIO_ReadFromInputPin(GPIOC, BUTTON_PIN) == 0)
        {
            GPIO_WriteToOutputPin(GPIOA, LED_PIN, GPIO_PIN_SET);
            printf("Button is pressed\n");
            delay_5ms();   // debounce
        }
        else
        {
            GPIO_WriteToOutputPin(GPIOA, LED_PIN, GPIO_PIN_RESET);
        }

        /* -------- Task 2: Alternating external LEDs -------- */
               GPIO_WriteToOutputPin(GPIOA, EXT_LED1_PIN, GPIO_PIN_SET);
               GPIO_WriteToOutputPin(GPIOA, EXT_LED2_PIN, GPIO_PIN_RESET);
               delay_250ms();

               GPIO_WriteToOutputPin(GPIOA, EXT_LED1_PIN, GPIO_PIN_RESET);
               GPIO_WriteToOutputPin(GPIOA, EXT_LED2_PIN, GPIO_PIN_SET);
               delay_250ms();
    }
}
